In [88]:
%load_ext sql
%sql mysql://root:pieseczek71@localhost

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

# Creating a schema

In [89]:
%%sql

CREATE SCHEMA IF NOT EXISTS resteurant_db;
USE resteurant_db;

CREATE TABLE IF NOT EXISTS ingredient(
    ID INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(64) NOT NULL UNIQUE,
    price DECIMAL(10,2) NOT NULL,
    isVegan BOOLEAN NOT NULL,
    isVegeterian BOOLEAN NOT NULL
);

CREATE TABLE IF NOT EXISTS pizza(
    ID INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(64) NOT NULL UNIQUE
);

CREATE TABLE IF NOT EXISTS pizzaIngredient(
    pizzaID INT NOT NULL,
    ingredientID INT NOT NULL,
    quantity INT NOT NULL,
    FOREIGN KEY (pizzaID) REFERENCES pizza(ID) ON DELETE RESTRICT,
    FOREIGN KEY (ingredientID) REFERENCES ingredient(ID) ON DELETE RESTRICT
);

CREATE TABLE IF NOT EXISTS drinkAndDesert(
    ID INT PRIMARY KEY AUTO_INCREMENT,
    name VARCHAR(64) NOT NULL UNIQUE,
    price DECIMAL(10,2) NOT NULL
);

CREATE TABLE IF NOT EXISTS deliveryPersonnel(
    ID INT PRIMARY KEY AUTO_INCREMENT,
    firstName VARCHAR(64) NOT NULL,
    lastName VARCHAR(64) NOT NULL,
    postalCode VARCHAR(6) NOT NULL,
    status VARCHAR(64) NOT NULL
);

CREATE TABLE IF NOT EXISTS customer(
    ID INT PRIMARY KEY AUTO_INCREMENT,
    firstName VARCHAR(64) NOT NULL,
    lastName VARCHAR(64) NOT NULL,
    gender VARCHAR(6) NOT NULL,
    birthDate DATE NOT NULL,
    phoneNumber VARCHAR(12) NOT NULL,
    email VARCHAR(100) NOT NULL UNIQUE,
    password VARCHAR(100) NOT NULL UNIQUE,
    address VARCHAR(100) NOT NULL,
    postalCode VARCHAR(6) NOT NULL,
    city VARCHAR(64) NOT NULL,
    pizzaCount INT NOT NULL
);

CREATE TABLE IF NOT EXISTS discountCode(
    ID VARCHAR(8) PRIMARY KEY,
    isUSED BOOLEAN NOT NULL,
    percentage INT NOT NULL
);

CREATE TABLE IF NOT EXISTS `order`(
    ID INT PRIMARY KEY AUTO_INCREMENT,
    customerID INT NOT NULL,
    placementTime DATETIME,
    status VARCHAR(32),
    deliveryPersonnelID INT,
    price DOUBLE,
    FOREIGN KEY (customerID) REFERENCES customer(ID) ON DELETE CASCADE,
    FOREIGN KEY (deliveryPersonnelID) REFERENCES deliveryPersonnel(ID) ON DELETE SET NULL
);

CREATE TABLE IF NOT EXISTS orderPizza(
    orderID INT,
    pizzaID INT NOT NULL,
    quantity INT NOT NULL,
    FOREIGN KEY (pizzaID) REFERENCES pizza(ID) ON DELETE RESTRICT,
    FOREIGN KEY (orderID) REFERENCES `order`(ID) ON DELETE CASCADE
);

CREATE TABLE IF NOT EXISTS orderDrinkAndDesert(
    orderID INT,
    drinkAndDesertID INT NOT NULL,
    quantity INT NOT NULL,
    FOREIGN KEY (drinkAndDesertID) REFERENCES drinkAndDesert(ID) ON DELETE RESTRICT,
    FOREIGN KEY (orderID) REFERENCES `order`(ID) ON DELETE CASCADE
);

 * mysql://root:***@localhost
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

### Check relationships

In [91]:
%%sql

SELECT
    TABLE_NAME,
    COLUMN_NAME,
    REFERENCED_TABLE_NAME,
    REFERENCED_COLUMN_NAME
FROM
    INFORMATION_SCHEMA.KEY_COLUMN_USAGE
WHERE
    TABLE_SCHEMA = 'resteurant_db'
    AND REFERENCED_TABLE_NAME IS NOT NULL;

 * mysql://root:***@localhost
8 rows affected.

[('order', 'customerID', 'customer', 'ID'),
 ('order', 'deliveryPersonnelID', 'deliveryPersonnel', 'ID'),
 ('orderDrinkAndDesert', 'drinkAndDesertID', 'drinkAndDesert', 'ID'),
 ('orderDrinkAndDesert', 'orderID', 'order', 'ID'),
 ('orderPizza', 'pizzaID', 'pizza', 'ID'),
 ('orderPizza', 'orderID', 'order', 'ID'),
 ('pizzaIngredient', 'pizzaID', 'pizza', 'ID'),
 ('pizzaIngredient', 'ingredientID', 'ingredient', 'ID')]

In [93]:
%%sql
SHOW TABLES;

 * mysql://root:***@localhost
10 rows affected.

[('customer',),
 ('deliveryPersonnel',),
 ('discountCode',),
 ('drinkAndDesert',),
 ('ingredient',),
 ('order',),
 ('orderDrinkAndDesert',),
 ('orderPizza',),
 ('pizza',),
 ('pizzaIngredient',)]

### Chect tables

In [116]:
%%sql
SELECT * FROM customer;

 * mysql://root:***@localhost
11 rows affected.

[(1, 'M&Ms', 'Pizzeria', 'Female', datetime.date(2024, 9, 1), '123456789', 'admin', 'password', 'Maastricht University', '', 'Maastricht', 0),
 (2, 'Misia', 'Krawczyk', 'Female', datetime.date(2005, 10, 30), '+48111222333', 'misia.krawczyk@gmail.com', 'jsjwo3ihne', 'Forum 100', '6229GV', 'Maastricht', 2),
 (3, 'John', 'Smith', 'Male', datetime.date(1992, 4, 15), '+48987654321', 'john.smith@example.com', 'wjub3ue', 'Main Street 2', '6229EN', 'Maastricht', 1),
 (4, 'Emily', 'Johnson', 'Female', datetime.date(1988, 12, 5), '+48123412345', 'emily.johnson@example.com', 'ki2h2ine', 'High Street 3', '6229EN', 'Maastricht', 2),
 (5, 'Robert', 'Williams', 'Male', datetime.date(1975, 9, 20), '+48987654322', 'robert.williams@example.com', 'kwni2eo', 'First Avenue 4', '6229EN', 'Maastricht', 3),
 (6, 'Alice', 'Brown', 'Female', datetime.date(1995, 1, 10), '+48123498765', 'alice.brown@example.com', '29eidin', 'Second Avenue 5', '6229EN', 'Maastricht', 4),
 (7, 'David', 'Jones', 'Male', datetime.date(1980, 11, 30), '+48987654323', 'david.jones@example.com', '293eindom', 'Elm Street 6', '6229GV', 'Maastricht', 5),
 (8, 'Laura', 'Miller', 'Female', datetime.date(1993, 6, 25), '+48123454321', 'laura.miller@example.com', 'kji293n', 'Oak Street 7', '6229GV', 'Maastricht', 6),
 (9, 'Paul', 'Davis', 'Male', datetime.date(1990, 3, 15), '+48987654324', 'paul.davis@example.com', 'i2heuibd', 'Pine Street 8', '6229GV', 'Maastricht', 7),
 (10, 'Sara', 'Wilson', 'Female', datetime.date(1998, 7, 22), '+48123476543', 'sara.wilson@example.com', 'j23ueu', 'Maple Street 9', '6229GV', 'Maastricht', 8),
 (11, 'Mark', 'Moore', 'Male', datetime.date(1985, 5, 17), '+48987654325', 'mark.moore@example.com', 'ih38b', 'Birch Street 10', '6229GV', 'Maastricht', 9)]

In [117]:
%%sql
SELECT * FROM deliveryPersonnel;

 * mysql://root:***@localhost
10 rows affected.

[(1, 'Lucas', 'Miller', '6229GV', 'avaliable'),
 (2, 'Emma', 'Smith', '6229GV', 'avaliable'),
 (3, 'Oliver', 'Johnson', '6229GV', 'avaliable'),
 (4, 'Sophia', 'Williams', '6211WH', 'avaliable'),
 (5, 'Liam', 'Brown', '6229EN', 'avaliable'),
 (6, 'Ava', 'Jones', '6229EN', 'avaliable'),
 (7, 'Noah', 'Garcia', '6229EN', 'avaliable'),
 (8, 'Isabella', 'Martinez', '6211WH', 'avaliable'),
 (9, 'Elijah', 'Davis', '6211WH', 'avaliable'),
 (10, 'Mia', 'Rodriguez', '6229EN', 'avaliable')]

In [120]:
%%sql

# INSERT IGNORE INTO ingredient (name, price, isVegan, isVegeterian)
# VALUES 
#     ('Pizza dough', 0.80, FALSE, TRUE),
#     ('Tomato sauce', 0.5, TRUE, TRUE),
#     ('Mozarella cheese', 1.2, FALSE, TRUE),
#     ('Pepperoni slices', 1.50, FALSE, FALSE),
#     ('Mushrooms', 0.70, TRUE, TRUE),
#     ('Green peppers', 0.40, TRUE, TRUE),
#     ('Red peppers', 0.40, TRUE, TRUE),
#     ('Ham', 1.20, FALSE, FALSE),
#     ('Cheddar cheese', 0.7, FALSE, TRUE),
#     ('Red onions', 0.30, TRUE, TRUE),
#     ('Olive oil', 0.20, TRUE, TRUE),
#     ('Oregano', 0.10, TRUE, TRUE),
#     ('BBQ sauce', 0.60, FALSE, TRUE),
#     ('Crispy bacon', 1.00, FALSE, TRUE),
#     ('Sweetcorn', 0.30, TRUE, TRUE),
#     ('Italian sausage', 1.5, FALSE, FALSE),
#     ('Ground beef', 1.4, FALSE, FALSE),
#     ('Grilled chicken breast', 1.80, FALSE, FALSE),
#     ('Rucola', 0.50, TRUE, TRUE),          
#     ('Feta cheese', 1.00, FALSE, TRUE),    
#     ('Truffle oil', 1.20, FALSE, TRUE),
#     ('Vegan mozzarella', 1.20, TRUE, TRUE),
#     ('Gorgonzola', 1.20, FALSE, TRUE),
#     ('Parmesan', 0.9, FALSE, TRUE), 
#     ('Spinach', 0.5, TRUE, TRUE);

 * mysql://root:***@localhost
0 rows affected.

[]

In [121]:
%%sql

SELECT * FROM ingredient;

 * mysql://root:***@localhost
25 rows affected.

[(1, 'Pizza dough', Decimal('0.80'), 0, 1),
 (2, 'Tomato sauce', Decimal('0.50'), 1, 1),
 (3, 'Mozarella cheese', Decimal('1.20'), 0, 1),
 (4, 'Pepperoni slices', Decimal('1.50'), 0, 0),
 (5, 'Mushrooms', Decimal('0.70'), 1, 1),
 (6, 'Green peppers', Decimal('0.40'), 1, 1),
 (7, 'Red peppers', Decimal('0.40'), 1, 1),
 (8, 'Ham', Decimal('1.20'), 0, 0),
 (9, 'Cheddar cheese', Decimal('0.70'), 0, 1),
 (10, 'Red onions', Decimal('0.30'), 1, 1),
 (11, 'Olive oil', Decimal('0.20'), 1, 1),
 (12, 'Oregano', Decimal('0.10'), 1, 1),
 (13, 'BBQ sauce', Decimal('0.60'), 0, 1),
 (14, 'Crispy bacon', Decimal('1.00'), 0, 1),
 (15, 'Sweetcorn', Decimal('0.30'), 1, 1),
 (16, 'Italian sausage', Decimal('1.50'), 0, 0),
 (17, 'Ground beef', Decimal('1.40'), 0, 0),
 (18, 'Grilled chicken breast', Decimal('1.80'), 0, 0),
 (19, 'Rucola', Decimal('0.50'), 1, 1),
 (20, 'Feta cheese', Decimal('1.00'), 0, 1),
 (21, 'Truffle oil', Decimal('1.20'), 0, 1),
 (22, 'Vegan mozzarella', Decimal('1.20'), 1, 1),
 (23, 'Gorgonzola', Decimal('1.20'), 0, 1),
 (24, 'Parmesan', Decimal('0.90'), 0, 1),
 (25, 'Spinach', Decimal('0.50'), 1, 1)]

In [122]:
# %%sql

# INSERT IGNORE INTO pizza (name) VALUES
# ('Margherita'),
# ('Vegan Margherita'),
# ('Pepperoni'),
# ('Parma'),
# ('Capricciosa'),
# ('Spinach & Feta'),
# ('4 cheese'),
# ('Veggie Surpreme'),
# ('Mushroom & Truffle'),
# ('Meat Lover''s');

 * mysql://root:***@localhost
0 rows affected.

[]

In [123]:
%%sql

SELECT * FROM pizza
ORDER BY ID;

 * mysql://root:***@localhost
10 rows affected.

[(1, 'Margherita'),
 (2, 'Vegan Margherita'),
 (3, 'Pepperoni'),
 (4, 'Parma'),
 (5, 'Capricciosa'),
 (6, 'Spinach & Feta'),
 (7, '4 cheese'),
 (8, 'Veggie Surpreme'),
 (9, 'Mushroom & Truffle'),
 (10, "Meat Lover's")]

In [124]:
# %%sql

# INSERT IGNORE INTO pizzaIngredient (pizzaID, ingredientID, quantity) VALUES
#     (1, (SELECT ID FROM ingredient WHERE name = 'Pizza dough'), 1),
#     (1, (SELECT ID FROM ingredient WHERE name = 'Tomato sauce'), 1),
#     (1, (SELECT ID FROM ingredient WHERE name = 'Mozarella cheese'), 1),
#     (1, (SELECT ID FROM ingredient WHERE name = 'Oregano'), 1),

#     (2, (SELECT ID FROM ingredient WHERE name = 'Pizza dough'), 1),
#     (2, (SELECT ID FROM ingredient WHERE name = 'Tomato sauce'), 1),
#     (2, (SELECT ID FROM ingredient WHERE name = 'Vegan mozarella'), 1),
#     (2, (SELECT ID FROM ingredient WHERE name = 'Oregano'), 1),

#     (3, (SELECT ID FROM ingredient WHERE name = 'Pizza dough'), 1),
#     (3, (SELECT ID FROM ingredient WHERE name = 'Tomato sauce'), 1),
#     (3, (SELECT ID FROM ingredient WHERE name = 'Mozarella cheese'), 1),
#     (3, (SELECT ID FROM ingredient WHERE name = 'Pepperoni slices'), 1),

#     (4, (SELECT ID FROM ingredient WHERE name = 'Pizza dough'), 1),
#     (4, (SELECT ID FROM ingredient WHERE name = 'Tomato sauce'), 1),
#     (4, (SELECT ID FROM ingredient WHERE name = 'Mozarella cheese'), 1),
#     (4, (SELECT ID FROM ingredient WHERE name = 'Ham'), 1),
#     (4, (SELECT ID FROM ingredient WHERE name = 'Rucola'), 1),

#     (5, (SELECT ID FROM ingredient WHERE name = 'Pizza dough'), 1),
#     (5, (SELECT ID FROM ingredient WHERE name = 'Tomato sauce'), 1),
#     (5, (SELECT ID FROM ingredient WHERE name = 'Mozarella cheese'), 1),
#     (5, (SELECT ID FROM ingredient WHERE name = 'Mushrooms'), 1),
#     (5, (SELECT ID FROM ingredient WHERE name = 'Ham'), 1),

#     (6, (SELECT ID FROM ingredient WHERE name = 'Pizza dough'), 1),
#     (6, (SELECT ID FROM ingredient WHERE name = 'Tomato sauce'), 1),
#     (6, (SELECT ID FROM ingredient WHERE name = 'Mozarella cheese'), 1),
#     (6, (SELECT ID FROM ingredient WHERE name = 'Spinach'), 1),
#     (6, (SELECT ID FROM ingredient WHERE name = 'Feta cheese'), 1),

#     (7, (SELECT ID FROM ingredient WHERE name = 'Pizza dough'), 1),
#     (7, (SELECT ID FROM ingredient WHERE name = 'Tomato sauce'), 1),
#     (7, (SELECT ID FROM ingredient WHERE name = 'Mozarella cheese'), 1),
#     (7, (SELECT ID FROM ingredient WHERE name = 'Cheddar cheese'), 1),
#     (7, (SELECT ID FROM ingredient WHERE name = 'Gorgonzola'), 1),
#     (7, (SELECT ID FROM ingredient WHERE name = 'Parmesan'), 1),

#     (8, (SELECT ID FROM ingredient WHERE name = 'Pizza dough'), 1),
#     (8, (SELECT ID FROM ingredient WHERE name = 'Tomato sauce'), 1),
#     (8, (SELECT ID FROM ingredient WHERE name = 'Mozarella cheese'), 1),
#     (8, (SELECT ID FROM ingredient WHERE name = 'Green peppers'), 1),
#     (8, (SELECT ID FROM ingredient WHERE name = 'Red peppers'), 1),
#     (8, (SELECT ID FROM ingredient WHERE name = 'Mushrooms'), 1),
#     (8, (SELECT ID FROM ingredient WHERE name = 'Sweetcorn'), 1),
#     (8, (SELECT ID FROM ingredient WHERE name = 'Red onions'), 1),

#     (9, (SELECT ID FROM ingredient WHERE name = 'Pizza dough'), 1),
#     (9, (SELECT ID FROM ingredient WHERE name = 'Tomato sauce'), 1),
#     (9, (SELECT ID FROM ingredient WHERE name = 'Mozarella cheese'), 1),
#     (9, (SELECT ID FROM ingredient WHERE name = 'Mushrooms'), 1),
#     (9, (SELECT ID FROM ingredient WHERE name = 'Truffle oil'), 1),

#     (10, (SELECT ID FROM ingredient WHERE name = 'Pizza dough'), 1),
#     (10, (SELECT ID FROM ingredient WHERE name = 'Tomato sauce'), 1),
#     (10, (SELECT ID FROM ingredient WHERE name = 'Mozarella cheese'), 1),
#     (10, (SELECT ID FROM ingredient WHERE name = 'Pepperoni slices'), 1),
#     (10, (SELECT ID FROM ingredient WHERE name = 'Crispy bacon'), 1),
#     (10, (SELECT ID FROM ingredient WHERE name = 'Italian sausage'), 1),
#     (10, (SELECT ID FROM ingredient WHERE name = 'Ground beef'), 1);

 * mysql://root:***@localhost
52 rows affected.

[]

In [105]:
# %%sql 

# INSERT IGNORE INTO drinkAndDesert (name, price)
# VALUES 
#     ('Tiramisu', 6.0),
#     ('Chocolate Lava Cake', 7.0),
#     ('Cheesecake', 6.5),
#     ('Coca-Cola', 2.5),
#     ('Fresh Orange Juice', 3.0),
#     ('Water', 1.5);

 * mysql://root:***@localhost
0 rows affected.

[]

In [125]:
%%sql 

SELECT * FROM pizzaIngredient;

 * mysql://root:***@localhost
52 rows affected.

[(1, 1, 1),
 (1, 2, 1),
 (1, 3, 1),
 (1, 12, 1),
 (2, 1, 1),
 (2, 2, 1),
 (2, 12, 1),
 (3, 1, 1),
 (3, 2, 1),
 (3, 3, 1),
 (3, 4, 1),
 (4, 1, 1),
 (4, 2, 1),
 (4, 3, 1),
 (4, 8, 1),
 (4, 19, 1),
 (5, 1, 1),
 (5, 2, 1),
 (5, 3, 1),
 (5, 5, 1),
 (5, 8, 1),
 (6, 1, 1),
 (6, 2, 1),
 (6, 3, 1),
 (6, 25, 1),
 (6, 20, 1),
 (7, 1, 1),
 (7, 2, 1),
 (7, 3, 1),
 (7, 9, 1),
 (7, 23, 1),
 (7, 24, 1),
 (8, 1, 1),
 (8, 2, 1),
 (8, 3, 1),
 (8, 6, 1),
 (8, 7, 1),
 (8, 5, 1),
 (8, 15, 1),
 (8, 10, 1),
 (9, 1, 1),
 (9, 2, 1),
 (9, 3, 1),
 (9, 5, 1),
 (9, 21, 1),
 (10, 1, 1),
 (10, 2, 1),
 (10, 3, 1),
 (10, 4, 1),
 (10, 14, 1),
 (10, 16, 1),
 (10, 17, 1)]

In [106]:
%%sql 

SELECT * FROM drinkAndDesert;

 * mysql://root:***@localhost
6 rows affected.

[(1, 'Tiramisu', Decimal('6.00')),
 (2, 'Chocolate Lava Cake', Decimal('7.00')),
 (3, 'Cheesecake', Decimal('6.50')),
 (4, 'Coca-Cola', Decimal('2.50')),
 (5, 'Fresh Orange Juice', Decimal('3.00')),
 (6, 'Water', Decimal('1.50'))]

In [107]:
%%sql
SELECT * FROM `order`;

 * mysql://root:***@localhost
1 rows affected.

[(16, 2, datetime.datetime(2024, 10, 15, 11, 22, 11), 'being prepared', None, 64.31400000000001)]

In [110]:
%%sql

SELECT * FROM orderPizza;

 * mysql://root:***@localhost
0 rows affected.

[]

In [111]:
%%sql

SELECT * FROM orderDrinkAndDesert;

 * mysql://root:***@localhost
0 rows affected.

[]